Repository: sassongal/JoyaFix
Catalog: Sources/JoyaFix/Resources/*.lproj/Localizable.strings
Languages: he

# about.version
source: Version %@
he: גרסה %@

# about.created.by
source: Created by
he: נוצר על ידי

# about.powered.by
source: Powered by
he: מופעל על ידי

# about.features
source: Features
he: תכונות

# about.close
source: Close
he: סגור

# about.copyright
source: © 2026 JoyaTech. All Rights Reserved.
he: © 2026 JoyaTech. כל הזכויות שמורות.

# about.feature.text.conversion
source: Smart Text Conversion (Hebrew ↔ English)
he: המרת טקסט חכמה (עברית ↔ אנגלית)

# about.feature.ocr
source: Smart OCR with Cloud & Local Support
he: OCR חכם עם תמיכה בענן ומקומי

# about.feature.keyboard.cleaner
source: Keyboard Cleaner Mode
he: מצב ניקוי מקלדת

# about.feature.snippets
source: Text Snippets & Auto-Expansion
he: קטעי טקסט והרחבה אוטומטית

# about.feature.clipboard
source: Advanced Clipboard History
he: היסטוריית לוח מתקדמת

# hotkey.duplicate.title
source: Duplicate Hotkey
he: קיצור דרך כפול

# hotkey.duplicate.message
source: This hotkey is already in use. Please choose a different one.
he: קיצור הדרך הזה כבר בשימוש. אנא בחר קיצור אחר.

# hotkey.duplicate.between
source: Hotkeys %@ and %@ use the same shortcut. Please change one of them.
he: קיצורי הדרך %@ ו-%@ משתמשים באותו קיצור. אנא שנה אחד מהם.

# settings.show.onboarding
source: Show Onboarding Again
he: הצג אונבורדינג שוב

# settings.show.onboarding.button
source: Show Again
he: הצג שוב

# about.whats.new
source: What's New
he: מה חדש

# onboarding.welcome.title
source: Welcome to JoyaFix
he: ברוכים הבאים ל-JoyaFix

# onboarding.welcome.subtitle
source: Your Ultimate Mac Utility
he: כלי המק שלך האולטימטיבי

# onboarding.welcome.description
source: Transform your workflow with smart text conversion, OCR, snippets, and more.
he: שפר את זרימת העבודה שלך עם המרת טקסט חכמה, OCR, קטעי טקסט ועוד.

# onboarding.ai.intro.title
source: The Heart of the App
he: הלב של האפליקציה

# onboarding.ai.intro.subtitle
source: Powered by Artificial Intelligence
he: מופעל על ידי בינה מלאכותית

# onboarding.ai.intro.description
source: We use AI to help you write better, translate text, and enhance your prompts. It's like having a writing assistant always ready.
he: אנחנו משתמשים ב-AI כדי לעזור לך לכתוב טוב יותר, לתרגם טקסט ולשפר את ההנחיות שלך. זה כמו עוזר כתיבה שתמיד מוכן.

# onboarding.ai.intro.feature1
source: Smart text improvement and enhancement
he: שיפור ועריכת טקסט חכמה

# onboarding.ai.intro.feature2
source: Instant translation between languages
he: תרגום מיידי בין שפות

# onboarding.ai.intro.feature3
source: Professional prompt engineering
he: הנדסת הנחיות מקצועית

# onboarding.the.magic.title
source: The Magic
he: הקסם

# onboarding.the.magic.subtitle
source: AI-Powered Text Enhancement
he: שיפור טקסט מונע AI

# onboarding.the.magic.description
source: Transform your writing with AI. Improve grammar, enhance clarity, and translate between languages instantly.
he: שפר את הכתיבה שלך עם AI. שפר דקדוק, הגבר בהירות ותרגם בין שפות באופן מיידי.

# onboarding.the.magic.feature1
source: Smart text improvement and enhancement
he: שיפור וחיזוק טקסט חכם

# onboarding.the.magic.feature2
source: Instant translation between languages
he: תרגום מיידי בין שפות

# onboarding.the.magic.feature3
source: Professional prompt engineering
he: הנדסת הנחיות מקצועית

# onboarding.ai.choice.title
source: Your Choice
he: הבחירה שלך

# onboarding.ai.choice.subtitle
source: Cloud or Local? Choose your privacy level.
he: ענן או מקומי? בחר את רמת הפרטיות שלך.

# onboarding.ai.choice.cloud.title
source: Cloud (Gemini)
he: ענן (Gemini)

# onboarding.ai.choice.cloud.feature1
source: Very smart & capable
he: חכם מאוד ויכולתי

# onboarding.ai.choice.cloud.feature2
source: Fast responses
he: תגובות מהירות

# onboarding.ai.choice.cloud.feature3
source: Requires internet
he: דורש אינטרנט

# onboarding.ai.choice.local.title
source: Local (100% Private)
he: מקומי (100% פרטי)

# onboarding.ai.choice.local.feature1
source: 100% privacy - no data leaves your Mac
he: 100% פרטיות - אין נתונים יוצאים מהמק שלך

# onboarding.ai.choice.local.feature2
source: Works offline
he: עובד ללא אינטרנט

# onboarding.ai.choice.local.feature3
source: One-time download
he: הורדה חד-פעמית

# onboarding.ai.choice.note
source: You can change this anytime in Settings
he: תוכל לשנות בכל עת בהגדרות

# onboarding.agent.title
source: Your Agent
he: הסוכן שלך

# onboarding.agent.subtitle
source: Configure Your AI Personality
he: הגדר את אישיות ה-AI שלך

# onboarding.agent.description
source: Customize how your AI assistant behaves. Set system instructions, creativity level, and response style.
he: התאם אישית איך עוזר ה-AI שלך מתנהג. הגדר הנחיות מערכת, רמת יצירתיות וסגנון תשובה.

# onboarding.agent.feature1
source: Customize system instructions
he: התאם אישית הנחיות מערכת

# onboarding.agent.feature2
source: Adjust creativity and tone
he: כוונן יצירתיות וטון

# onboarding.agent.feature3
source: Choose from preset personalities
he: בחר מאישיויות מוגדרות מראש

# onboarding.agent.note
source: You can change this anytime in Settings → AI Persona
he: תוכל לשנות זאת בכל עת בהגדרות → אישיות AI

# onboarding.local.setup.title
source: Local Model Setup
he: הגדרת מודל מקומי

# onboarding.local.setup.description
source: Download a local AI model to run entirely on your Mac. Your data never leaves your computer.
he: הורד מודל AI מקומי שירוץ לגמרי על המק שלך. המידע שלך לא יוצא מהמחשב.

# onboarding.local.setup.skip.description
source: You've chosen cloud AI. You can skip this step or download a local model as backup.
he: בחרת ב-AI בענן. תוכל לדלג על שלב זה או להוריד מודל מקומי כגיבוי.

# onboarding.local.setup.download
source: Download Recommended Model
he: הורד מודל מומלץ

# onboarding.local.setup.downloaded
source: Downloaded
he: הורד

# onboarding.local.setup.cancel
source: Cancel
he: בטל

# onboarding.local.setup.switch.hint
source: Want complete privacy?
he: רוצה פרטיות מלאה?

# onboarding.local.setup.switch
source: Switch to Local AI
he: עבור ל-AI מקומי

# onboarding.permissions.required
source: Required
he: נדרש

# onboarding.permissions.microphone.title
source: Microphone
he: מיקרופון

# onboarding.permissions.microphone.description
source: Required for voice input feature. Allows the app to record audio for speech-to-text.
he: נדרש לתכונת הקלט הקולי. מאפשר לאפליקציה להקליט שמע להמרת דיבור לטקסט.

# onboarding.permissions.speech.title
source: Speech Recognition
he: זיהוי דיבור

# onboarding.permissions.speech.description
source: Required for voice input. Allows transcription in Hebrew and English.
he: נדרש לקלט קולי. מאפשר תמלול בעברית ובאנגלית.

# onboarding.ready.hotkey.hint
source: Your main shortcut for AI features:
he: קיצור הדרך הראשי שלך לתכונות AI:

# onboarding.features.title
source: Powerful Features
he: תכונות חזקות

# onboarding.features.subtitle
source: Discover what makes JoyaFix special
he: גלה מה הופך את JoyaFix למיוחד

# onboarding.feature.convert.title
source: Fix Hebrew/English
he: תיקון עברית/אנגלית

# onboarding.feature.convert.description
source: Instantly convert between Hebrew and English keyboard layouts
he: המר מיידית בין פריסות מקלדת עברית ואנגלית

# onboarding.feature.ocr.title
source: Smart OCR
he: OCR חכם

# onboarding.feature.ocr.description
source: Extract text from any screen region with cloud or local OCR
he: חלץ טקסט מכל אזור במסך עם OCR בענן או מקומי

# onboarding.feature.snippets.title
source: Text Snippets
he: קטעי טקסט

# onboarding.feature.snippets.description
source: Create shortcuts that expand into full text automatically
he: צור קיצורי דרך שמתרחבים לטקסט מלא אוטומטית

# onboarding.feature.snippets.example
source: Example: Type '!mail' → expands to 'gal@joyatech.com'
he: דוגמה: הקלד '!mail' → מתרחב ל-'gal@joyatech.com'

# onboarding.ai.features.note
source: AI features (Prompt Enhancer) require a free Gemini API Key. Get yours from Google AI Studio.
he: תכונות AI (שיפור טקסט) דורשות מפתח Gemini API חינמי. קבל את שלך מ-Google AI Studio.

# onboarding.detailed.features.title
source: Complete Feature Guide
he: מדריך תכונות מלא

# onboarding.detailed.features.subtitle
source: Everything you need to know about JoyaFix
he: כל מה שצריך לדעת על JoyaFix

# onboarding.detailed.convert.title
source: Smart Text Conversion
he: המרת טקסט חכמה

# onboarding.detailed.convert.description
source: Automatically detect and convert text between Hebrew and English keyboard layouts. Preserves formatting, handles uppercase, and works with rich text.
he: זהה והמר אוטומטית טקסט בין פריסות מקלדת עברית ואנגלית. שומר על עיצוב, מטפל באותיות גדולות ועובד עם טקסט עשיר.

# onboarding.detailed.ocr.title
source: Advanced OCR
he: OCR מתקדם

# onboarding.detailed.ocr.description
source: Extract text from any screen region using cloud AI (Gemini) or local Vision framework. Supports multiple monitors and preserves text formatting.
he: חלץ טקסט מכל אזור במסך באמצעות AI בענן (Gemini) או מסגרת Vision מקומית. תומך במסכים מרובים ושומר על עיצוב טקסט.

# onboarding.detailed.snippets.title
source: Text Snippets & Auto-Expansion
he: קטעי טקסט והרחבה אוטומטית

# onboarding.detailed.snippets.description
source: Create custom shortcuts that automatically expand into full text. Supports variables, conditionals, and dynamic content like dates and clipboard.
he: צור קיצורי דרך מותאמים אישית שמתרחבים אוטומטית לטקסט מלא. תומך במשתנים, תנאים ותוכן דינמי כמו תאריכים ולוח.

# onboarding.detailed.clipboard.title
source: Advanced Clipboard History
he: היסטוריית לוח מתקדמת

# onboarding.detailed.clipboard.description
source: Rich clipboard history with search, pinning, and paste as plain text. Supports RTF, HTML, and plain text with smart categorization.
he: היסטוריית לוח עשירה עם חיפוש, הצמדה והדבקה כטקסט רגיל. תומך ב-RTF, HTML וטקסט רגיל עם קטגוריזציה חכמה.

# onboarding.detailed.keyboard.title
source: Keyboard Cleaner Mode
he: מצב ניקוי מקלדת

# onboarding.detailed.keyboard.description
source: Lock your keyboard to prevent accidental input while cleaning. Visual overlay shows lock status. Unlock with hotkey or hold ESC for 3 seconds.
he: נעל את המקלדת כדי למנוע קלט מקרי בזמן ניקוי. שכבת עיצוב מציגה את סטטוס הנעילה. שחרר עם קיצור דרך או החזק ESC למשך 3 שניות.

# onboarding.detailed.ai.title
source: AI Prompt Enhancer
he: משפר הנחיות AI

# onboarding.detailed.ai.description
source: Transform raw text into professional, structured LLM prompts using Google Gemini AI. Review and refine prompts before use.
he: המר טקסט גולמי להנחיות LLM מקצועיות ומבניות באמצעות Google Gemini AI. סקור ושפר הנחיות לפני השימוש.

# onboarding.permissions.title
source: Permissions Required
he: הרשאות נדרשות

# onboarding.permissions.description
source: JoyaFix needs the following permissions to work properly:
he: JoyaFix צריך את ההרשאות הבאות כדי לעבוד כראוי:

# onboarding.permissions.accessibility.title
source: Accessibility
he: נגישות

# onboarding.permissions.accessibility.description
source: Required for keyboard shortcuts and text conversion
he: נדרש לקיצורי מקלדת והמרת טקסט

# onboarding.permissions.input.monitoring.title
source: Input Monitoring
he: ניטור קלט

# onboarding.permissions.input.monitoring.description
source: Required for keyboard shortcuts and text capture
he: נדרש לקיצורי מקלדת ולכידת טקסט

# onboarding.permissions.screen.recording.title
source: Screen Recording
he: הקלטת מסך

# onboarding.permissions.screen.recording.description
source: Required for OCR screen capture
he: נדרש לצילום מסך ל-OCR

# onboarding.permissions.grant.access
source: Grant Access
he: אשר גישה

# onboarding.permissions.granted
source: Granted
he: אושר

# onboarding.ready.title
source: You're All Set!
he: הכל מוכן!

# onboarding.ready.description
source: JoyaFix is ready to use. Click below to get started.
he: JoyaFix מוכן לשימוש. לחץ למטה כדי להתחיל.

# onboarding.ready.button
source: Get Started
he: בואו נתחיל

# onboarding.back
source: Back
he: חזור

# onboarding.next
source: Next
he: הבא

# settings.general.title
source: General
he: כללי

# settings.snippets.title
source: Snippets
he: קטעי טקסט

# settings.text.conversion.hotkey
source: Text Conversion Hotkey
he: קיצור מקלדת להמרת טקסט

# settings.text.conversion.hotkey.description
source: Press the button and type your desired key combination:
he: לחץ על הכפתור והקלד את צירוף המקשים הרצוי:

# settings.ocr.hotkey
source: OCR Screen Capture Hotkey
he: קיצור מקלדת לצילום מסך OCR

# settings.ocr.hotkey.description
source: Press the button and type your desired key combination:
he: לחץ על הכפתור והקלד את צירוף המקשים הרצוי:

# settings.clipboard.history
source: Clipboard History
he: היסטוריית לוח

# settings.clipboard.history.max.items
source: Maximum items to save:
he: מספר מקסימלי של פריטים לשמירה:

# settings.clipboard.history.current
source: Currently saving last %d items
he: כרגע שומרים את %d הפריטים האחרונים

# settings.behavior
source: Behavior
he: התנהגות

# settings.behavior.play.sound
source: Play sound on text conversion
he: נגן צליל בהמרת טקסט

# settings.behavior.auto.paste
source: Auto-paste after conversion
he: הדבק אוטומטית לאחר המרה

# settings.api.configuration
source: API Configuration
he: הגדרות API

# settings.api.configuration.description
source: Configure your Google Gemini API key for AI features (Prompt Enhancer and Cloud OCR).
he: הגדר את מפתח Google Gemini API שלך לתכונות AI (שיפור טקסט ו-OCR בענן).

# settings.api.gemini.key
source: Gemini API Key
he: מפתח API של Gemini

# settings.api.gemini.key.placeholder
source: Enter your Gemini API key
he: הכנס את מפתח ה-API של Gemini

# settings.api.gemini.key.description
source: Get your free API key from Google AI Studio: https://aistudio.google.com/app/apikey
he: קבל את מפתח ה-API החינמי שלך מ-Google AI Studio: https://aistudio.google.com/app/apikey

# settings.api.key.secure.storage
source: Your API key is stored securely in the macOS Keychain.
he: מפתח ה-API שלך נשמר בצורה מאובטחת ב-Keychain של macOS.

# settings.ocr.configuration
source: OCR Configuration
he: הגדרות OCR

# settings.ocr.use.cloud
source: Use Cloud OCR (Gemini API)
he: השתמש ב-OCR בענן (Gemini API)

# settings.ocr.gemini.key
source: Gemini API Key
he: מפתח API של Gemini

# settings.ocr.gemini.key.placeholder
source: Enter your Gemini API key
he: הכנס את מפתח ה-API של Gemini

# settings.ocr.gemini.key.description
source: Get your API key from Google AI Studio
he: קבל את מפתח ה-API מ-Google AI Studio

# settings.save.changes
source: Save Changes
he: שמור שינויים

# settings.reset
source: Reset
he: איפוס

# settings.saved
source: Settings saved successfully!
he: ההגדרות נשמרו בהצלחה!

# settings.snippets.add
source: Add Snippet
he: הוסף קטע טקסט

# settings.snippets.trigger
source: Trigger
he: טריגר

# settings.snippets.content
source: Content
he: תוכן

# settings.snippets.actions
source: Actions
he: פעולות

# settings.snippets.empty
source: No snippets yet. Click 'Add Snippet' to create one.
he: אין קטעי טקסט עדיין. לחץ על 'הוסף קטע טקסט' כדי ליצור אחד.

# settings.snippets.edit
source: Edit
he: ערוך

# settings.snippets.delete
source: Delete
he: מחק

# settings.snippets.save
source: Save
he: שמור

# settings.snippets.cancel
source: Cancel
he: בטל

# settings.snippets.trigger.placeholder
source: e.g., !mail
he: לדוגמה, !mail

# settings.snippets.content.placeholder
source: e.g., gal@joyatech.com
he: לדוגמה, gal@joyatech.com

# snippet.variable.prompt.title
source: Enter Variable Value
he: הכנס ערך למשתנה

# snippet.variable.prompt.message
source: Enter value for variable: %@
he: הכנס ערך למשתנה: %@

# snippet.variable.help
source: Variables: {date}, {time}, {clipboard}, {name}, {email}, etc. Conditionals: {if:condition:true:false}
he: משתנים: {date}, {time}, {clipboard}, {name}, {email}, וכו' תנאים: {if:condition:true:false}

# menu.convert.selection
source: Convert Selection Layout
he: המר פריסת בחירה

# menu.extract.text
source: Extract Text from Screen...
he: חלץ טקסט מהמסך...

# menu.keyboard.cleaner
source: Keyboard Cleaner Mode
he: מצב ניקוי מקלדת

# menu.unlock.keyboard
source: Unlock Keyboard
he: פתח מקלדת

# menu.clear.history
source: Clear History
he: נקה היסטוריה

# menu.settings
source: Settings...
he: הגדרות...

# menu.keyboard.shortcuts
source: Keyboard Shortcuts...
he: קיצורי מקלדת...

# menu.about
source: About JoyaFix
he: אודות JoyaFix

# menu.quit
source: Quit
he: צא

# menu.smart.translate
source: Smart Translate (AI)
he: תרגום חכם (AI)

# menu.vision.lab
source: Vision Lab
he: מעבדת ראייה

# menu.coming.soon
source: Coming Soon
he: בקרוב

# alert.accessibility.title
source: Accessibility Permission Required
he: הרשאת נגישות נדרשת

# alert.accessibility.message
source: JoyaFix needs Accessibility permission to simulate keyboard shortcuts (Cmd+C, Cmd+V, Delete).
he: JoyaFix צריך הרשאת נגישות כדי לדמות קיצורי מקלדת (Cmd+C, Cmd+V, Delete).

# alert.screen.recording.title
source: Screen Recording Permission Required
he: הרשאת הקלטת מסך נדרשת

# alert.screen.recording.message
source: JoyaFix needs Screen Recording permission to capture screen regions for OCR. Please grant this permission in System Settings → Privacy & Security → Screen Recording, then try again.
he: JoyaFix צריך הרשאת הקלטת מסך כדי לצלם אזורי מסך ל-OCR. אנא אשר הרשאה זו בהגדרות המערכת → פרטיות ואבטחה → הקלטת מסך, ואז נסה שוב.

# alert.error.title
source: JoyaFix Error
he: שגיאת JoyaFix

# alert.button.open.settings
source: Open System Settings
he: פתח הגדרות מערכת

# alert.button.cancel
source: Cancel
he: בטל

# alert.button.ok
source: OK
he: אישור

# alert.rate.limit.title
source: Cloud OCR Rate Limit
he: מגבלת קצב OCR בענן

# alert.rate.limit.message
source: You've reached the rate limit for Cloud OCR (%d requests per minute). Please wait %d seconds before trying again, or use Local OCR instead. You can switch to Local OCR in Settings → General → OCR Configuration.
he: הגעת למגבלת הקצב ל-OCR בענן (%d בקשות לדקה). אנא המתן %d שניות לפני שתנסה שוב, או השתמש ב-OCR מקומי במקום. תוכל לעבור ל-OCR מקומי בהגדרות → כללי → הגדרות OCR.

# ocr.selection.help
source: Drag to select area for scanning
he: גרור כדי לבחור אזור לסריקה

# ocr.selection.instructions
source: Enter to confirm • ESC to cancel
he: Enter לאישור • ESC לביטול

# shortcuts.global.title
source: Global Hotkeys
he: קיצורים גלובליים

# shortcuts.clipboard.title
source: Clipboard History
he: היסטוריית לוח

# shortcuts.ocr.title
source: OCR Shortcuts
he: קיצורי OCR

# shortcuts.tips.title
source: Tips
he: טיפים

# settings.permissions.title
source: Permissions
he: הרשאות

# settings.permissions.description
source: JoyaFix requires the following permissions to function properly:
he: JoyaFix דורש את ההרשאות הבאות כדי לפעול כראוי:

# settings.permissions.accessibility.title
source: Accessibility
he: נגישות

# settings.permissions.accessibility.description
source: Required to simulate keyboard shortcuts (Cmd+C, Cmd+V, Delete) for text conversion, snippet expansion, and keyboard cleaner mode.
he: נדרש לדמות קיצורי מקלדת (Cmd+C, Cmd+V, Delete) להמרת טקסט, הרחבת קטעי טקסט ומצב ניקוי מקלדת.

# settings.permissions.screen.recording.title
source: Screen Recording
he: הקלטת מסך

# settings.permissions.screen.recording.description
source: Required to capture screen regions for OCR feature.
he: נדרש לצילום אזורי מסך לתכונת OCR.

# settings.permissions.granted
source: Granted
he: אושר

# settings.permissions.not.granted
source: Not Granted
he: לא אושר

# settings.permissions.open.settings
source: Open Settings
he: פתח הגדרות

# settings.permissions.refresh
source: Refresh
he: רענן

# settings.system.integration
source: System Integration
he: אינטגרציה למערכת

# settings.launch.at.login
source: Launch at Login
he: הפעל בעת עליית המחשב

# settings.check.updates
source: Check for Updates
he: בדוק עדכונים

# settings.check.updates.button
source: Check Now
he: בדוק עכשיו

# update.alert.title
source: Update Available
he: עדכון זמין

# update.alert.message
source: A new version of JoyaFix is available (v%@). %@
he: גרסה חדשה של JoyaFix זמינה (v%@). %@

# update.alert.button
source: Download
he: הורד

# update.alert.cancel
source: Later
he: מאוחר יותר

# update.alert.no.update.title
source: You're Up to Date
he: אתה מעודכן

# update.alert.no.update.message
source: JoyaFix is already running the latest version.
he: JoyaFix כבר רץ בגרסה העדכנית ביותר.

# settings.launch.at.login.error.title
source: Launch at Login Error
he: שגיאה בהפעלה בעת עלייה

# settings.launch.at.login.error
source: Failed to %@ Launch at Login. Please check System Settings → General → Login Items.
he: נכשל ב-%@ ההפעלה בעת עלייה. אנא בדוק בהגדרות המערכת → כללי → פריטי התחלה.

source: enable
he: הפעלת

source: disable
he: ביטול

# settings.prompt.enhancer.hotkey
source: Prompt Enhancer Hotkey
he: קיצור מקלדת לשיפור טקסט (AI)

# settings.prompt.enhancer.hotkey.description
source: Press the button and type your desired key combination:
he: לחץ על הכפתור והקלד את צירוף המקשים הרצוי:

# menu.enhance.prompt
source: Enhance Selected Text (AI)
he: שפר טקסט נבחר (AI)

# prompt.enhancer.error.no.text
source: No text selected or clipboard is empty.
he: לא נבחר טקסט או שהלוח ריק.

# prompt.enhancer.error.api.failed
source: Failed to enhance text. Please check your API key and internet connection.
he: השיפור נכשל. אנא בדוק את מפתח ה-API ואת החיבור לרשת.

# prompt.enhancer.error.api.key.title
source: Gemini API Key Required
he: נדרש מפתח Gemini API

# prompt.enhancer.error.api.key.message
source: To use AI features, please enter your Google Gemini API Key in Settings.
he: כדי להשתמש בתכונות AI, יש להזין מפתח Google Gemini API בהגדרות.

# prompt.enhancer.error.title
source: Prompt Enhancement Error
he: שגיאת שיפור טקסט

# prompt.enhancer.error.api.key.detailed
source: Gemini API key not found. Please configure your API key in Settings → General → API Configuration. Get your free API key from: https://aistudio.google.com/app/apikey
he: מפתח Gemini API לא נמצא. אנא הגדר את מפתח ה-API בהגדרות → כללי → הגדרות API. קבל מפתח API חינמי מ: https://aistudio.google.com/app/apikey

# prompt.enhancer.error.api.key.invalid
source: The API key is invalid or has been revoked. Please check your API key in Settings and make sure it's correct. Get a new API key from: https://aistudio.google.com/app/apikey
he: מפתח ה-API לא תקין או בוטל. אנא בדוק את מפתח ה-API בהגדרות וודא שהוא נכון. קבל מפתח API חדש מ: https://aistudio.google.com/app/apikey

# prompt.enhancer.error.api.key.forbidden
source: The API key doesn't have permission to access Gemini API. Please check your API key permissions or get a new key from: https://aistudio.google.com/app/apikey
he: למפתח ה-API אין הרשאה לגשת ל-Gemini API. אנא בדוק את הרשאות מפתח ה-API או קבל מפתח חדש מ: https://aistudio.google.com/app/apikey

# prompt.enhancer.error.invalid.url
source: Invalid API configuration. Please check your internet connection and try again.
he: הגדרת API לא תקינה. אנא בדוק את החיבור לרשת ונסה שוב.

# prompt.enhancer.error.network.detailed
source: Network error occurred: %@ Please check your internet connection and try again.
he: אירעה שגיאת רשת: %@ אנא בדוק את החיבור לרשת ונסה שוב.

# prompt.enhancer.error.http
source: Server error (HTTP %d): %@ Please try again in a few moments.
he: שגיאת שרת (HTTP %d): %@ אנא נסה שוב בעוד כמה רגעים.

# prompt.enhancer.error.rate.limit
source: Rate limit exceeded. You've made too many requests. Please wait a moment and try again.
he: מגבלת קצב הושגה. ביצעת יותר מדי בקשות. אנא המתן רגע ונסה שוב.

# prompt.enhancer.error.rate.limit.wait
source: Rate limit exceeded. Please wait %d seconds before trying again.
he: מגבלת קצב הושגה. אנא המתן %d שניות לפני שתנסה שוב.

# prompt.enhancer.error.invalid.response
source: Received an invalid response from the API. Please try again.
he: התקבלה תגובה לא תקינה מה-API. אנא נסה שוב.

# prompt.enhancer.error.max.retries
source: Maximum retry attempts reached. Please check your internet connection and try again later.
he: הגעת למספר הניסיונות המקסימלי. אנא בדוק את החיבור לרשת ונסה שוב מאוחר יותר.

# library.tab.title
source: Library
he: ספרייה
