Repository: sassongal/JoyaFix
Catalog: Sources/JoyaFix/Resources/*.lproj/Localizable.strings
Languages: he

# library.search.placeholder
source: Search prompts...
he: חפש הנחיות...

# library.empty.state
source: No prompts found. Create your own!
he: לא נמצאו הנחיות. צור משלך!

# library.action.copy
source: Copy
he: העתק

# library.action.edit
source: Edit
he: ערוך

# library.action.delete
source: Delete
he: מחק

# library.add.new
source: Add Prompt
he: הוסף הנחיה

# library.editor.title.add
source: New Prompt
he: הנחיה חדשה

# library.editor.title.edit
source: Edit Prompt
he: ערוך הנחיה

# library.editor.title.label
source: Title
he: כותרת

# library.editor.content.label
source: Prompt Content
he: תוכן ההנחיה

# library.editor.save
source: Save
he: שמור

# library.editor.cancel
source: Cancel
he: בטל

# library.default.polish
source: Professional Polish
he: ליטוש מקצועי

# library.default.code
source: Code Review
he: ביקורת קוד

# library.default.summarize
source: Summarize
he: סיכום

# library.default.translate
source: Translate to Hebrew
he: תרגום לעברית

# library.default.explain
source: Explain Simply
he: הסבר פשוט

# keyboard.lock.overlay.message
source: Keyboard Locked - Hold ESC for 3 seconds to Unlock
he: המקלדת נעולה - החזק ESC למשך 3 שניות לשחרור

# local.llm.intel.warning
source: Intel Mac detected. Local AI may run slower than on Apple Silicon Macs.
he: זוהה מק עם Intel. ה-AI המקומי עשוי לרוץ לאט יותר מאשר במקים עם Apple Silicon.

# local.llm.unknown.hardware.warning
source: Could not detect hardware type. Performance may vary.
he: לא ניתן לזהות את סוג החומרה. הביצועים עשויים להשתנות.

# local.llm.insufficient.ram
source: Not enough free memory. Close other apps to use local AI.
he: אין מספיק זיכרון פנוי. סגור אפליקציות אחרות כדי להשתמש ב-AI מקומי.

# local.llm.critical.ram
source: System memory critically low. Please close some applications.
he: זיכרון המערכת נמוך מאוד. אנא סגור כמה אפליקציות.

# local.llm.auto.unloaded
source: Local AI model unloaded to free memory (15 min idle).
he: מודל AI מקומי נפרק כדי לשחרר זיכרון (15 דקות ללא פעילות).

# local.llm.performance.fast
source: Fast
he: מהיר

# local.llm.performance.good
source: Good
he: טוב

# local.llm.performance.moderate
source: Moderate
he: בינוני

# local.llm.performance.slow
source: Slow
he: איטי

# local.llm.performance.unknown
source: Unknown
he: לא ידוע

# local.llm.not.recommended.intel
source: Large model - may be slow on Intel Mac
he: מודל גדול - עשוי להיות איטי במק Intel

# ollama.not.running
source: Ollama is not running. Please start it with 'ollama serve' in Terminal.
he: Ollama לא רץ. הפעל אותו עם 'ollama serve' בטרמינל.

# ollama.model.not.selected
source: No Ollama model selected. Please select a model in Settings.
he: לא נבחר מודל Ollama. בחר מודל בהגדרות.

# ollama.vision.not.supported
source: This model supports text only, not images.
he: מודל זה תומך בטקסט בלבד, לא בתמונות.

# ollama.vision.suggestion
source: For vision tasks, use LLaVA (ollama pull llava) or switch to Gemini.
he: לתיאור תמונות, השתמש ב-LLaVA (ollama pull llava) או עבור ל-Gemini.

# ollama.text.only.warning
source: This model is text-only. For image description, use LLaVA or Gemini.
he: מודל זה הוא טקסט בלבד. לתיאור תמונות, השתמש ב-LLaVA או Gemini.

# vision.local.not.supported
source: Selected local model doesn't support vision. Download LLaVA for image description.
he: המודל המקומי הנבחר אינו תומך בראייה. הורד LLaVA לתיאור תמונות.

# vision.ollama.not.supported
source: Selected Ollama model doesn't support vision. Use LLaVA or switch to Gemini.
he: מודל ה-Ollama הנבחר אינו תומך בראייה. השתמש ב-LLaVA או עבור ל-Gemini.

# vision.openrouter.not.supported
source: Selected OpenRouter model doesn't support vision. Choose a vision-capable model.
he: מודל ה-OpenRouter הנבחר אינו תומך בראייה. בחר מודל עם יכולת ראייה.

# agent.config.profile
source: Agent Profile
he: פרופיל הסוכן

# agent.config.name
source: Agent Name
he: שם הסוכן

# agent.config.system.instructions
source: System Instructions
he: הנחיות מערכת (System Instructions)

# agent.config.parameters
source: Parameters
he: פרמטרים

# agent.config.creativity
source: Creativity (Temperature)
he: יצירתיות (Temperature)

# agent.config.creativity.description
source: Lower = more focused and consistent, Higher = more creative and varied
he: נמוך = ממוקד, גבוה = יצירתי

# agent.config.max.tokens
source: Max Response Length
he: אורך תשובה מקסימלי

# agent.config.max.tokens.description
source: Maximum number of tokens in the AI response
he: מספר מקסימלי של טוקנים בתשובה

# agent.config.presets
source: Preset Agents
he: סוכנים מוגדרים מראש

# agent.config.reset
source: Reset to Default
he: איפוס לברירת מחדל

# settings.ai.persona.title
source: AI Persona
he: אישיות AI

# settings.ai.persona.description
source: Configure how the AI assistant behaves and responds.
he: הגדר את האישיות וההתנהגות של עוזר ה-AI שלך

# settings.ai.persona.explanation
source: The AI persona defines the personality, writing style, and behavior of JoyaFix when enhancing your text.
he: אישיות ה-AI (סוכן) קובעת איך ה-AI מגיב להנחיות שלך. תוכל להתאים אישית את הנחיות המערכת, רמת היצירתיות ואורך התשובה.
